; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	spectrograph2 - mode
	image1 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 111)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 102)
	(supports instrument3 spectrograph2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 112)
	(supports instrument6 image1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star1)
	(supports instrument7 image1)
	(supports instrument7 spectrograph2)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 image1)
	(supports instrument8 spectrograph2)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 106)
	(= (data Star3 image0) 39)
	(= (data Star4 image0) 135)
	(= (data Star5 image0) 157)
	(= (data Planet6 image0) 34)
	(= (data Star3 spectrograph2) 260)
	(= (data Star4 spectrograph2) 82)
	(= (data Star5 spectrograph2) 256)
	(= (data Planet6 spectrograph2) 245)
	(= (data Star3 image1) 18)
	(= (data Star4 image1) 295)
	(= (data Star5 image1) 127)
	(= (data Planet6 image1) 258)
	(= (slew_time Star1 GroundStation0) 36)
	(= (slew_time GroundStation0 Star1) 36)
	(= (slew_time GroundStation2 GroundStation0) 67.85)
	(= (slew_time GroundStation0 GroundStation2) 67.85)
	(= (slew_time GroundStation2 Star1) 39.07)
	(= (slew_time Star1 GroundStation2) 39.07)
	(= (slew_time Star3 GroundStation0) 27.76)
	(= (slew_time GroundStation0 Star3) 27.76)
	(= (slew_time Star3 Star1) 7.855)
	(= (slew_time Star1 Star3) 7.855)
	(= (slew_time Star3 GroundStation2) 63.11)
	(= (slew_time GroundStation2 Star3) 63.11)
	(= (slew_time Star4 GroundStation0) 3.114)
	(= (slew_time GroundStation0 Star4) 3.114)
	(= (slew_time Star4 Star1) 79.88)
	(= (slew_time Star1 Star4) 79.88)
	(= (slew_time Star4 GroundStation2) 35.02)
	(= (slew_time GroundStation2 Star4) 35.02)
	(= (slew_time Star4 Star3) 7.526)
	(= (slew_time Star3 Star4) 7.526)
	(= (slew_time Star5 GroundStation0) 14.49)
	(= (slew_time GroundStation0 Star5) 14.49)
	(= (slew_time Star5 Star1) 71.28)
	(= (slew_time Star1 Star5) 71.28)
	(= (slew_time Star5 GroundStation2) 28.12)
	(= (slew_time GroundStation2 Star5) 28.12)
	(= (slew_time Star5 Star3) 15.19)
	(= (slew_time Star3 Star5) 15.19)
	(= (slew_time Star5 Star4) 48.2)
	(= (slew_time Star4 Star5) 48.2)
	(= (slew_time Planet6 GroundStation0) 48.04)
	(= (slew_time GroundStation0 Planet6) 48.04)
	(= (slew_time Planet6 Star1) 9.977)
	(= (slew_time Star1 Planet6) 9.977)
	(= (slew_time Planet6 GroundStation2) 1.371)
	(= (slew_time GroundStation2 Planet6) 1.371)
	(= (slew_time Planet6 Star3) 10.1)
	(= (slew_time Star3 Planet6) 10.1)
	(= (slew_time Planet6 Star4) 85.21)
	(= (slew_time Star4 Planet6) 85.21)
	(= (slew_time Planet6 Star5) 11.64)
	(= (slew_time Star5 Planet6) 11.64)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(pointing satellite3 Star1)
	(have_image Star4 spectrograph2)
	(have_image Star5 image1)
	(have_image Planet6 spectrograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation2 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 102 to 38.89, (fuel-used) from 0 to 63.11
   goals met: 1 of 5
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 5
3. (turn_to satellite3 star3 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star3)
   changed: (fuel satellite3) from 106 to 95.9, (fuel-used) from 63.11 to 73.21
   goals met: 1 of 5
4. (turn_to satellite2 planet6 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 112 to 110.629, (fuel-used) from 73.21 to 74.581
   goals met: 1 of 5
5. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 5
6. (turn_to satellite3 star1 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 95.9 to 88.045, (fuel-used) from 74.581 to 82.436
   goals met: 2 of 5
7. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 2 of 5
8. (turn_to satellite3 star3 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star3)
   changed: (fuel satellite3) from 88.045 to 80.19, (fuel-used) from 82.436 to 90.291
   goals met: 1 of 5
9. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 1 of 5
10. (turn_to satellite3 star4 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star4)
   changed: (fuel satellite3) from 80.19 to 72.664, (fuel-used) from 90.291 to 97.817
   goals met: 1 of 5
11. (take_image satellite3 star4 instrument6 spectrograph2)
   added: (have_image star4 spectrograph2)
   changed: (data_capacity satellite3) from 1000 to 918, (data-stored) from 0 to 82
   goals met: 2 of 5
12. (turn_to satellite3 star3 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star3)
   changed: (fuel satellite3) from 72.664 to 65.138, (fuel-used) from 97.817 to 105.343
   goals met: 2 of 5
13. (turn_to satellite3 star1 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 65.138 to 57.283, (fuel-used) from 105.343 to 113.198
   goals met: 3 of 5
14. (turn_to satellite3 planet6 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 57.283 to 47.306, (fuel-used) from 113.198 to 123.175
   goals met: 2 of 5
15. (take_image satellite3 planet6 instrument6 spectrograph2)
   added: (have_image planet6 spectrograph2)
   changed: (data_capacity satellite3) from 918 to 673, (data-stored) from 82 to 327
   goals met: 3 of 5
16. (turn_to satellite3 star1 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 47.306 to 37.329, (fuel-used) from 123.175 to 133.152
   goals met: 4 of 5
17. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 4 of 5
18. (turn_to satellite2 groundstation2 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 110.629 to 109.258, (fuel-used) from 133.152 to 134.523
   goals met: 4 of 5
19. (turn_to satellite2 planet6 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 109.258 to 107.887, (fuel-used) from 134.523 to 135.894
   goals met: 4 of 5
20. (turn_to satellite2 groundstation2 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 107.887 to 106.516, (fuel-used) from 135.894 to 137.265
   goals met: 4 of 5
21. (turn_to satellite2 planet6 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 106.516 to 105.145, (fuel-used) from 137.265 to 138.636
   goals met: 4 of 5
22. (turn_to satellite2 star5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 105.145 to 93.505, (fuel-used) from 138.636 to 150.276
   goals met: 4 of 5
23. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 4 of 5
24. (turn_to satellite2 planet6 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 93.505 to 81.865, (fuel-used) from 150.276 to 161.916
   goals met: 4 of 5
25. (turn_to satellite2 groundstation2 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 81.865 to 80.494, (fuel-used) from 161.916 to 163.287
   goals met: 4 of 5
26. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 4 of 5
27. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 4 of 5
28. (turn_to satellite2 star5 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 80.494 to 52.374, (fuel-used) from 163.287 to 191.407
   goals met: 4 of 5
29. (take_image satellite2 star5 instrument5 image1)
   added: (have_image star5 image1)
   changed: (data_capacity satellite2) from 1000 to 873, (data-stored) from 327 to 454
   goals met: 5 of 5
